app/Controllers/AdminController.php

    public function index()
    {

        $session = session();
		$fleet = $session->get('fleet');
		$data = $session->get();
		$direktor = $data['name'];
		$dugoviNaplataModel = new DugoviNaplataModel();
		$tvrtkaModel = new TvrtkaModel();
		$tvrtkaModel = new TvrtkaModel();
		$vozaciModel = new DriverModel();
		$obracunFirmaModel = new ObracunFirmaModel();
		$tvrtka = $tvrtkaModel->where('fleet', $fleet)->get()->getRowArray();
		$vozaciAktivni = $vozaciModel->where('fleet', $fleet)->where('aktivan', '1')->countAllResults();
		$vozaciNeaktivni = $vozaciModel->where('fleet', $fleet)->where('aktivan', '0')->countAllResults();
		$vozaciPrijava = $vozaciModel->where('fleet', $fleet)->where('aktivan', '1')->where('prijava', '1')->countAllResults();
		$week = $obracunFirmaModel->selectMax('week')->where('fleet', $fleet)->get()->getRowArray();
---
SELECT *
FROM `tvrtka`
WHERE `fleet` = 'Premium Rides'
SELECT COUNT(*) AS `numrows`
FROM `vozaci`
WHERE `fleet` = 'Premium Rides'
AND `aktivan` = '1'
SELECT COUNT(*) AS `numrows`
FROM `vozaci`
WHERE `fleet` = 'Premium Rides'
AND `aktivan` = '0'
SELECT COUNT(*) AS `numrows`
FROM `vozaci`
WHERE `fleet` = 'Premium Rides'
AND `aktivan` = '1'
AND `prijava` = '1'
SELECT MAX(`week`) AS `week`
FROM `obracunFirma`
WHERE `fleet` = 'Premium Rides'

		}else{
			$weekbefore = 202352;
		}
		$zadnjiObracun = $obracunFirmaModel->where('fleet', $fleet)->where('week', $week)->get()->getRowArray();
		$predzadnjiObracun = $obracunFirmaModel->where('fleet', $fleet)->where('week', $weekbefore)->get()->getRowArray();
		$firmaObracuni = $obracunFirmaModel->where('fleet', $fleet)->get()->getResultArray();
---
SELECT *
FROM `obracunFirma`
WHERE `fleet` = 'Premium Rides'
AND `week` = 202436
SELECT *
FROM `obracunFirma`
WHERE `fleet` = 'Premium Rides'