app/Controllers/ObracunController.php

SELECT `report_for_week`
FROM `bolt_reports`
WHERE `fleet` = 'Premium Rides'
SELECT COUNT(*) AS `numrows`
FROM `obracun`
WHERE `fleet` = 'Premium Rides'
AND `week` = '202303'
SELECT *
FROM `obracunFirma`
WHERE `fleet` = 'Premium Rides'
AND `week` = '202303'
---
	public function index(){
		$session = session();
		$data = $session->get();
		$fleet = $session->get('fleet');

		$UberReportModel = new UberReportModel();
		$BoltReportModel = new BoltReportModel();
		$ObracunModel = new ObracunModel();
		$ObracunFirmaModel = new ObracunFirmaModel();

		$weeks = $BoltReportModel->select('report_for_week')->where('fleet', $fleet)->get()->getResultArray();
		foreach($weeks as $we){$reportForWeek[] = $we['report_for_week'];}
		$reportForWeek = array_unique($reportForWeek);

		$dostupnoZaObracun = array();
		// Provjeravamo dali postoji gotov obračun
		foreach($reportForWeek as $week){
			$zbrojObracuna = $ObracunModel->where('fleet', $fleet)->where('week', $week)->countAllResults();
			if($zbrojObracuna > 0){
				$obracun = $ObracunFirmaModel->where('fleet', $fleet)->where('week', $week)->get()->getRowArray();