app/Models/TrgovciModel.php

SELECT *
FROM `trgovci`
JOIN `prMjTrgovca` ON `prMjTrgovca`.`trgovci_id` = `trgovci`.`id`
---
	public function getTrgovciWithPrMjTrgovca()
	{
		$builder = $this->db->table('trgovci');
		$builder->join('prMjTrgovca', 'prMjTrgovca.trgovci_id = trgovci.id');
		$query = $builder->get();